export default {
  intro: {
    texts: [
      '你有点浑浑噩噩，感觉有些不对，但是回忆不起是哪里不对。',
      '你究竟在逃避些什么？那些痛苦的回忆？',
      '我知道你撑不住了，这里是你封藏的那些记忆，和某些人、某个人相关的回忆。',
      '作为一个四处奔波的异乡人，刚被某游戏公司裁掉的你，当时究竟为什么还会留在这座城市。',
      '努力想想，你们初次相遇时，就在那个吧台，点了一瓶酒，我还记得店员是{{在柜子的第二层}}取下来的。',
      '你是程序，她是美术。'
    ]
  },
  steps: [
    {
      itemCount: 1,
      texts: [
        '那时的你并未想到，你们还会有第二次相遇。',
        '这相遇仍是一次偶然，并且恰巧还会在同一个地点——',
        '一次游戏活动，她就在那个{{自动售货机}}前。'
      ]
    },
    {
      itemCount: 1,
      texts: [
        '你们在一起了，却在相处后，有了越来越多的争吵。',
        '终于有一次，你们都说了一些狠话，仅仅是踟蹰的瞬间，她的身影便消失于了眼前。',
        '犹豫和徘徊了许久的你，按照直觉，再次来到了这里，然后你发现——',
        '她{{正坐在那个角落，望着窗外}}，一言不发。'
      ]
    },
    {
      itemCount: 1,
      texts: [
        '那次之后，连带着你们共同的游戏理想，她彻底离开了你。',
        '你失魂落魄，反复诘问着自己为了理想到底牺牲了什么，然后又不断用新的“理想”麻醉自己。',
        '你完成了一些项目，内心却知道再也找不到那样的一个人了，再也没有那样的快乐了。',
        '你再也没有找过新的对象，出于“体面”，你也再也没有打探过她的消息。',
        '直到多年后的某一天，出于一次偶然，不知道是忘却了还是...你打破了“原则”，再次来到了这里。',
        '在这一次名为GlobalGameJam的活动中，你却发现她就{{坐在那个沙发上}}，错愕地望着你。'
      ]
    },
    {
      itemCount: 1,
      texts: [
        '你逃走了，连带着这些记忆。',
        '但既然又回到了这个地方，走到了这一步，还是让我告诉你一件真正重要的事情吧。',
        '她在最后给你留下了一封信，虽然从未真正“看过”，但我却一直保存着。',
        '打开它吧，然后做出选择。'
      ]
    }
  ],
  items: {
    wine: {
      texts: [
        '你们点了一瓶质量并不高的红酒，那时的你并不知道她和你一样，都不怎么喝酒。',
        '对酒精比较敏感的你们小酌稍许，便打开了话匣子。',
        '你说：“现在的业界都是什么垃圾游戏”。',
        '她说：“是啊，一直这么搞下去，不知道什么时候才能出来精彩的作品。”',
        '你说：“对，像极乐迪斯科、Gorogoa那样精彩的作品！”',
        '她说：“哈哈，我也很喜欢这两部，遇到同好了。”'
      ]
    },
    vending: {
      texts: [
        '“这么巧？”你远远就望见了她，假装偶遇漫不经心搭起了话。',
        '“啊是你，我就猜你也会来。”她转过了头，甜甜得笑着。',
        '你说：“嗯，这次活动来了不少独立开发者，扩展一下交际圈。”',
        '她停顿了下，拿出了手机：“我也是这么想的...嗯，这么巧，不如加个微信？”',
        '你看着她，故作体面，缓缓拿出了手机：“好，有什么好作品可以互相交流。”',
        '她说：“对哦，正好有个双人游戏一直找不到人打，你有兴趣嘛？”'
      ]
    },
    corner: {
      texts: [
        '你走到了角落，默默看着她，一言不发。',
        '她用余光瞥了你一眼，你能够看到她的眼角还有泪花。',
        '你说：“我...我还是觉得我想的没错，你太激动了，这事肯定还有办法。”',
        '她低着头，小声：“你，还是这个样子，真是一点都没变。”',
        '你不解，仿佛还有点自豪：“我当然不会改变，这是我的特质，改变了就不是我了。”',
        '她说：“唉...是啊，你是不会改变的，我知道的。”',
        '接着她站了起来，给了你一个拥抱，你很错愕，杵在原地不知如何是好。',
        '“我...”还没等你说完，她便松开了你，转身快步离去。',
        '从此，你再也没有找到过她。'
      ]
    },
    sofa: {
      texts: [
        '虽然已经过去了许久，但你还是一眼就认出了她。',
        '同样她也一眼就认出了你，在互相错愕的神情中，你们相视无言。',
        '“好...好久不见”这次仍然是她先主动开的口。',
        '你忽然有一种感觉，想说什么，却下意识克制住了：“确实...好久不见。”',
        '再也没有对话，再也没有交流，活动就这么过去了。',
        '只是在结束之后，她似乎递过来了什么东西，你好像收了，又好像没收。',
        '然后，你就被困住了。'
      ]
    }
  },
  chars: {
    xinyi: {
      name: '路人Z?',
      texts: [
        '这两人聊得还挺投机的，说不定有戏。',
        '就是这小子，最后扭扭捏捏的，真不像话。',
        '年轻人，试一试有什么大不了的，连个微信都不敢加，呸！',
        '哪怕再勇敢一点点...这事八成不就成了吗？'
      ]
    },
    roam: {
      name: '路人Y?',
      texts: [
        '怯懦，退缩，故作体面。',
        '现在的小伙子，都不如女孩子勇敢。',
        '要是这时候开始改变心态，不被牵着走，多付出些努力。',
        '也不会是后来的下场吧？'
      ]
    },
    hikari: {
      name: '路人H?',
      texts: [
        '以“永远不会改变”为傲的少年。',
        '以“不为任何人妥协”为荣的少年。',
        '不知伤害为何物的少年。',
        '不知妥协为何物的少年。',
        '现在的你，是怎么想的呢？'
      ]
    },
    final: {
      name: '你的影子们',
      texts: [
        '相识时，被动。',
        '相知时，被动。',
        '相离时，被动。',
        '用“理想”掩饰“怠惰”。',
        '以“桀骜”定义“崇高”。',
        '将“鲁莽”命名为“真诚”。',
        '脆弱的我，懦弱的我，怯懦的我。',
        '如果真的勇敢一些，会不会更好呢？'
      ]
    }
  },
  letter: {
    texts: [
      '不知道你会不会打开这封信，按照你的性格，大概是不会吧。',
      '毕竟，我最了解你了，你会觉得很麻烦嘛，逃避麻烦，也是你“不变”的一部分。',
      '但即便如此，我还是写了这封信，之所以如此，是因为——',
      '我恨你，非常得恨，因为我倾尽了所有勇气对你好，却没有任何用。',
      '你一直都是那个样子，从未变过，你不懂得什么是包容，不懂得什么是妥协。',
      '你将其命名为“真诚”，哪怕明知会伤害我，却将其称为“必要的代价”。',
      '什么代价啊？这么爱你的人，却要被你当做代价，你真的有人的心吗？',
      '......',
      '虽然想骂更多，但边看着你边写的我，却也只能到此为止了。',
      '毕竟你现在样子，和那时候已经完全不同了。',
      '你看起来更“友善随和”了，但可能只有我知道这对于你而言是多么得艰难。',
      '所以虽然别人看起来你成为了一个更好的人，但我却觉得有些可悲。',
      '你失去了原先那种鲁莽的勇气，却没有找到更为坚定的勇气。',
      '你到底在畏惧什么呢？到底...在害怕什么呢？畏惧改变，畏惧失去自我吗？',
      '你想一直活在悬浮于空的象牙塔上，畏惧在真正的大地上生根，那样会让你失去自由，所以你必须永不认错，一直桀骜——本应是如此。',
      '但你刚才的眼神，你这个人啊，永远都需要有人主动拉一把才会去做选择。',
      '那么，这次你的选择到底是什么？'
    ]
  }
}
